import pytest
from src.widget import mask_account_card
from src.widget import get_date

@pytest.mark.parametrize("number, expected", [
    ("Maestro 1596837868705199", "Maestro 1596 83** **** 5199"),
    ("Счет 64686473678894779589", "Счет **9589"),
    ("MasterCard 7158300734726758", "MasterCard 7158 30** **** 6758"),
    ("Счет 35383033474447895560", "Счет **5560"),
    ("Visa Classic 6831982476737658", "Visa Classic 6831 98** **** 7658"),
    ("Visa Platinum 8990922113665229", "Visa Platinum 8990 92** **** 5229"),
    ("Visa Gold 5999414228426353", "Visa Gold 5999 41** **** 6353"),
    ("Счет 73654108430135874305", "Счет **4305")
])

def test_mask_account_card_valid(number, expected):
    assert mask_account_card(number) == expected

@pytest.mark.parametrize("number, expected", [
    ("Счет 646864736788947795 89", "Введены не корректные значения"),
    ("Счет 64686dfe473678894779589", "Введены не корректные значения"),
    ("Счет 6468+4736788947795/9", "Введены не корректные значения"),
    ("Счет 646864736788947795891111", "Введены не корректные значения"),
    ("Счет 6468647367889477", "Введены не корректные значения"),

    ("Maestro 1596 837868705199", "Введены не корректные значения"),
    ("Maestro 15968378687051991111", "Введены не корректные значения"),
    ("Maestro 159683786870", "Введены не корректные значения"),
    ("Maestro 15968378687c05s1d99", "Введены не корректные значения"),

])

def test_mask_account_card_invalid(number, expected):
    assert mask_account_card(number) == expected

@pytest.mark.parametrize("value, expected", [
    ("2024-03-11T02:26:18.671407", "11.03.2024"),
    ("T02:26:18.671407", "Введена не корректная дата"),
    ("11-03-2024T02:26:18.671407", "Введена не корректная дата"),
    ("02:26:18.671407T2024-03-11", "Введена не корректная дата"),
    ("02:26:18.671407T11-03-2024", "Введена не корректная дата"),
    ("2024.03.11T02:26:18.671407", "Введена не корректная дата"),
])
def test_get_date(value, expected):
    assert get_date(value) == expected
